noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430f427.h
/* SD16CCTLx - AFECCTLx */
#define SD16GRP             (0x0001u)  /* SD16 Grouping of Channels: 0:Off/1:On */
#define SD16SC              (0x0002u)  /* SD16 Start Conversion */
#define SD16IFG             (0x0004u)  /* SD16 Channel x Interrupt Flag */
#define SD16IE              (0x0008u)  /* SD16 Channel x Interrupt Enable */
#define SD16DF              (0x0010u)  /* SD16 Channel x Data Format: 0:Unipolar/1:Bipolar */
#define SD16OVIFG           (0x0020u)  /* SD16 Channel x Overflow Interrupt Flag */
#define SD16LSBACC          (0x0040u)  /* SD16 Channel x Access LSB of ADC */
#define SD16LSBTOG          (0x0080u)  /* SD16 Channel x Toggle LSB Output of ADC */
#define SD16OSR0            (0x0100u)  /* SD16 Channel x OverSampling Ratio 0 */
#define SD16OSR1            (0x0200u)  /* SD16 Channel x OverSampling Ratio 1 */
#define SD16SNGL            (0x0400u)  /* SD16 Channel x Single Conversion On/Off */

#define SD16OSR_256         (0x0000u)  /* SD16 Channel x OverSampling Ratio 256 */
#define SD16OSR_128         (0x0100u)  /* SD16 Channel x OverSampling Ratio 128 */
#define SD16OSR_64          (0x0200u)  /* SD16 Channel x OverSampling Ratio  64 */
#define SD16OSR_32          (0x0300u)  /* SD16 Channel x OverSampling Ratio  32 */

/* SD16IV Definitions */
#define SD16IV_NONE         (0x0000u)    /* No Interrupt pending */
#define SD16IV_SD16OVIFG    (0x0002u)    /* SD16OVIFG */
#define SD16IV_SD16MEM0     (0x0004u)    /* SD16MEM0 SD16IFG */
#define SD16IV_SD16MEM1     (0x0006u)    /* SD16MEM1 SD16IFG */
#define SD16IV_SD16MEM2     (0x0008u)    /* SD16MEM2 SD16IFG */

/************************************************************
* Interrupt Vectors (offset from 0xFFE0)
************************************************************/

#define BASICTIMER_VECTOR   (0 * 2u)  /* 0xFFE0 Basic Timer */
#define PORT2_VECTOR        (1 * 2u)  /* 0xFFE2 Port 2 */
#define PORT1_VECTOR        (4 * 2u)  /* 0xFFE8 Port 1 */
#define TIMERA1_VECTOR      (5 * 2u)  /* 0xFFEA Timer A CC1-2, TA */
#define TIMERA0_VECTOR      (6 * 2u)  /* 0xFFEC Timer A CC0 */
#define USART0TX_VECTOR     (8 * 2u)  /* 0xFFF0 USART 0 Transmit */
#define USART0RX_VECTOR     (9 * 2u)  /* 0xFFF2 USART 0 Receive */
#define WDT_VECTOR          (10 * 2u) /* 0xFFF4 Watchdog Timer */

#define SD16_VECTOR         (12 * 2u) /* 0xFFF8 Sigma Delta ADC */

#define NMI_VECTOR          (14 * 2u) /* 0xFFFC Non-maskable */
#define RESET_VECTOR        (15 * 2u) /* 0xFFFE Reset [Highest Priority] */

#define UART0TX_VECTOR      USART0TX_VECTOR
#define UART0RX_VECTOR      USART0RX_VECTOR

/************************************************************
* End of Modules
************************************************************/
#pragma language=default

#endif /* #ifndef __msp430x42x */

